import './Legal.css';
import Header from './Header';
import Footer from './footer';
import {
    BrowserRouter as Router,
    Switch,
    Route,
    Link,
  } from 'react-router-dom'
function Legal() {
    return(
    <div className='legal'>
            <Header></Header>
        <div>
            <p>
            Гра переважно відбувається з виглядом від першої особи. Протагоніст має кодове ім'я Ві (V), його походження, стать, зовнішність і голос налаштовуються на початку. Залежно від походження, Ві отримає різні стартові значення характеристик «Сила» (здатність носити важкі предмети, ефективність ближнього бою, витривалість), «Рефлекси» (ефективність стрілянини та володіння холодною зброєю), «Технічні здібності» (рівень вправності з високотехнологічною зброєю, майстрування, технічна обізнаність), «Інтелект» (злам і програмування) і «Холоднокровність» (прихованість і ефективність діалогів).

Ві може вирішувати завдання різним шляхом: убивати ворогів особисто аби досягнути цілі, пробиратися потай, покладатися на силу зброї або швидкість руху. Для вдосконалення своїх здібностей Ві потрібно купувати й оновлювати кіберпрограми, ставити собі кібернетичне оснащення. Імплантати дозволяють вдосконалити відчуття, посилювати захист, точніше стріляти, зламувати ворожі імплантати тощо, створюючи власний стиль гри. Весь сюжет можливо пройти, не скоївши жодного вбивства.

Зброя поділяється на три категорії: стандартна, технічна (дозволяє вражати крізь перепони) та «розумна» (самонавідна). Ушкодження мають чотири типи дії: фізична, теплова, електромагнітна та хімічна.

Місце дії, Найт-Сіті, складається з шести регіонів — корпоративного міського центру, заселеного іммігрантами Вотсона, розкішного Вестбруку, передмістя Гейвуда, нетрів Пасифіки та промислового Санто-Домінго. Місто оточує спустошена територія. Подорожувати між ними Ві може як пішки, так і на транспортних засобах — мотоциклах і автомобілях. В їхньому багажнику, крім того, зберігаються речі, за якими можна повернутися в міру потреби. В автомобілі також можна слухати місцеве радіо. Сам Ві має квартиру й гараж. У місті динамічно змінюється час доби й погода. Так, вночі Найт-Сіті наповнюють неонові вогні, змінюються перехожі.

Подекуди живуть іншомовні персонажі, і щоб розуміти їх, Ві повинен поставити собі спеціальний імплантат-перекладач. Залежно від регіону, правоохоронці по-різному реагують на скоєні Ві злочини. Також, до нього по-різному ставляться банди, що подекуди цілком контролюють території. В деяких місцях пропонуються мініігри: хакерство, автоперегони, змагання в різних видах бою і стрілянини.

Від різних персонажів Ві отримує завдання, за виконання яких отримує досвід, репутацію і кошти. Головні надавачі завдань називаються «фіксерами», вони можуть зателефонувати Ві в будь-який момент, нагадуючи про своє доручення/прохання. Досвід підвищує рівень розвитку персонажа та дозволяє вдосконалювати з кожним рівнем якусь характеристику, відкриваючи додаткові здібності. Крім того, здібності можна розвинути, придбавши спеціальні чипи, або довго вправляючись у відповідному занятті. Висока репутація дає доступ до нових, відповідальніших і важчих завдань, а також до нової зброї та кібернетичних імплантатів. Походження Ві та результати попередніх вчинків зумовлюють ставлення інших персонажів. Від вчинків і репутації залежать варіанти відповідей в діалогах. При цьому на відповідь дається лише певний час
            </p>
        </div>
        <nav>
    
</nav>
        <Footer></Footer>
        
    </div>
);

}
export default Legal;
